&НаСервереБезКонтекста
Процедура ЗагрузитьСертификатНаСервере()
    переменная1 = 1;
    переменная2 = 2;
    Если переменная1 < переменная2 Тогда
        переменная2 = 0;
    ИначеЕсли переменная1 = переменная2 Тогда
        переменная2 = 2;
    Иначе
        переменная2 = 0;
    КонецЕсли;
    
КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьСертификат(Команда)
        // do nothing
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСертификатЗавершение(Результат, АдресВременногоХранилища, ВыбранноеИмя, ДополнительныеПараметры) Экспорт
    Если Результат Тогда
        АдресСертификата = АдресВременногоХранилища;
        СертификатЗагружен = Не ПустаяСтрока(АдресСертификата);
    КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    АдресСертификата = "aaa";
    Если АдресСертификата <> "" Тогда
        ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресСертификата);
        Константы.СертификатМобильногоПриложенияIOS.Установить(Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных()));
    КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Сертификат = Константы.СертификатМобильногоПриложенияIOS.Получить().Получить();
    СертификатЗагружен = ЗначениеЗаполнено(Сертификат);

КонецПроцедуры

 